# 1. Объединение и пересечение множеств (10 баллов)
# Напишите программу, которая создает два множества из чисел, введенных
# пользователем. Программа должна вывести их объединение и пересечение.
# Пример вывода:
# A = {1, 2, 3}
# B = {3, 4, 5}
# Объединение: {1, 2, 3, 4, 5}
# Пересечение: {3}



def union_set(a, b):
    return a.union(b) # or a | b

def intersection(a, b):
    return a.intersection(b) # or a & b

A = {1, 2, 3}
B = {3, 4, 5}

print(union_set(A, B))
print(intersection(A, B))