# 2. Симметрическая разность множеств (10 баллов)
# Напишите программу, которая находит симметрическую разность двух множеств,
# введенных пользователем. Симметрическая разность включает элементы, которые
# принадлежат только одному из множеств, но не обоим.
# Пример вывода:
# A = {1, 2, 3}
# B = {2, 3, 4}
# Симметрическая разность: {1, 4}



def sym_diff(a, b):
    return a.symmetric_difference(b)

A = {1, 2, 3}
B = {2, 3, 4}

print(sym_diff(A, B))