# 3. Проверка подмножества (10 баллов)
# Напишите программу, которая проверяет, является ли одно множество
# подмножеством другого.
# Пример вывода:
# A = {1, 2}
# B = {1, 2, 3, 4}
# A является подмножеством B: True



def subset(a, b):
    return a.issubset(b)

A = {1, 2}
B = {1, 2, 3, 4}

if subset(A, B):
    print(f'A является подмножеством B: {subset(A, B)}')

else:
    print(f'A не является подмножеством B: {subset(A, B)}')
