# 4. Словарь квадратов чисел (10 баллов)
# Напишите программу, которая создает словарь, где ключи — это числа от 1 до N, а
# значения — это квадраты этих чисел. N вводится пользователем.
# Пример вывода:
# {1: 1, 2: 4, 3: 9, 4: 16, 5: 25}




def squares(n):
    new_dict = {}
    
    for i in range (1, n+1):
        new_dict[i] = i**2

    return new_dict
    

print(squares(4))