# 5. Инверсия словаря (15 баллов)
# Напишите программу, которая инвертирует словарь — меняет местами ключи и
# значения.
# Пример вывода:
# Оригинальный словарь: {'a': 1, 'b': 2, 'c': 3}
# Инвертированный словарь: {1: 'a', 2: 'b', 3: 'c'}



def inversed_set(set1):
    new_set = {}

    for key, value in set1.items():
        new_set[value] = key

    return new_set

set = {'a': 1, 'b': 2, 'c': 3}

print(inversed_set(set))