# 7. Удаление всех четных чисел из множества (10 баллов)
# Напишите программу, которая принимает множество из чисел и удаляет из него все
# четные числа.
# Пример вывода:
# Исходное множество: {1, 2, 3, 4, 5, 6}
# Множество после удаления четных чисел: {1, 3, 5}



def delete (set):
    new_set = set.copy()

    for i in set:
        if i % 2 == 0:
            new_set.remove(i) # .discard()

    return new_set

set = {1, 2, 3, 4, 5, 6}

print(delete(set))