# 3. Функция подсчета чисел в диапазоне (15 баллов)
# Напишите функцию count_in_range, которая принимает список чисел и два значения
# — нижнюю и верхнюю границу. Функция должна возвращать количество чисел из
# списка, которые попадают в указанный диапазон (включительно).
# 
# Пример:
# print(count_in_range([1, 5, 10, 20, 30], 5, 20)) # 3


def count_in_range(lst,start,end):
    count = 0
    for i in range(lst.index(start), lst.index(end) + 1):
        count += 1
    
    return count
        
print(count_in_range([1, 5, 10, 20, 30], 1, 30))