# 4. Функция по возврату квадрата числа (10 баллов)
# Напишите функцию square, которая принимает одно число и возвращает его квадрат.

# Пример:
# print(square(5)) # 25


def square(num):
    return num ** 2

print(square(5))