# 1. Квадраты всех элементов списка
# Задача: Напишите функцию, которая принимает список
# чисел и возвращает список их квадратов, используя map.

num = [1, 2 ,3, 4, 5]
squeres = list(map(lambda x: x**2, num))
print(squeres)


# 2. Фильтрация четных чисел
# Задача: Напишите функцию, которая принимает список
# чисел и возвращает только четные числа, используя filter.

numbers = [5, 6, 8, 11, 43, 42, 34]
even_numbers = list(filter(lambda x: x % 2 == 0, numbers))
print(even_numbers)


# 3. Сумма чисел в списке
# Задача: Используя reduce, напишите функцию, которая
# суммирует все элементы в списке.

from functools import reduce
number = [2, 5, 12, 35, 23]
result = reduce(lambda x, y: x + y, number)
print(result)


# 4. Возведение чисел в степень
# Задача: Напишите функцию, которая принимает список
# чисел и степень, в которую нужно возвести каждое число.
# Используйте map для этой операции.

num_1 = [7, 9, 3, 4, 8]
power = list(map(lambda x: x * x, num_1))
print(power)


# 5. Список всех чисел больше среднего
# Задача: Напишите функцию, которая принимает список чисел и
# возвращает только те числа, которые больше среднего,
# используя filter.

num_2 = [2, 3, -5, -12, 6, 8]
sum = 0
for i in num_2:
    sum += i

average = sum / len(num_2)

list_new = list(filter(lambda x: x > average, num_2))
print(list_new)



# 6. Проверка на наличие отрицательных чисел
# Задача: Напишите функцию, которая принимает список чисел
# и проверяет, есть ли среди них отрицательные числа,
# используя any и map.

num_2 = [2, 3, -5, -12, 6, 8]
negative_num = any(map(lambda x: x < 0, num_2 ))
print(negative_num)



# 7. Подсчет длины каждой строки
# Задача: Напишите функцию, которая принимает список строк
# и возвращает список их длин, используя map.

fruits = ["apple", "banana", "pear", "kiwi"]
count_len = list(map(lambda x: len(x), fruits))
print(count_len)



# 8. Сумма квадратов всех чисел
# Задача: Напишите функцию, которая принимает список чисел и
# возвращает сумму их квадратов, используя map и reduce.

from functools import reduce

num_1 = [7, 9, 3, 4, 8]

sum = list(map(lambda x: x * x, num_1))
sum_of_sqrt = reduce(lambda x, y: x + y, sum)

print(sum_of_sqrt)



# 9. Преобразование списка чисел в строки
# Задача: Напишите функцию, которая принимает список чисел
# и возвращает список строк, представляющих эти числа, используя map.

num_2 = [2, 3, -5, -12, 6, 8]
str_numbers = list(map(lambda x: str(x), num_2 ))
print(str_numbers)
